In [1]:
# I will add extra steps to this code just so I can review the next homework, I will be making several assumptions.
# Assumption 1: The SQL database was not studied thoroughly.
# Assumption 2: This is the first file opened either by acccident or in purpose. 
    # Going by Assumption 2. That means everything known about the DB is unknown.
#Assumption 3: I am using this a thorough review. So i will put comments throughout to indicate where its really a review sake and not really belonging to either the above assumption.

# First Lets get the Password And Username imported
from config import USERN, PWD

import sqlalchemy
from sqlalchemy.orm import Session
from sqlalchemy.ext.automap import automap_base
from sqlalchemy import create_engine, inspect, func

# Creating the Engine
from sqlalchemy import create_engine
engine = create_engine(f'postgresql://'+USERN+':'+ PWD +'@localhost:5432/EmployeeDBz')
connection = engine.connect()

# Install Matplotlib to chart
import pandas as pd
import matplotlib
from matplotlib import style
style.use('seaborn')
import matplotlib.pyplot as plt

In [2]:

# Inspector is used to get all the table names.

inspector = inspect(engine)
inspector.get_table_names()

['dept_empl', 'departments', 'titles', 'employees', 'dept_man', 'salaries']

In [3]:
# So we got 6 tables
# From this 6 we need employees, titles, salaries

# Lets see the what are the data types for the 3 tables. And their respective column names
# This will also have a copy and paste purpose later on

SalaryCol = inspector.get_columns('salaries')
SalaryCol

[{'name': 'emp_no',
  'type': INTEGER(),
  'nullable': False,
  'default': None,
  'autoincrement': False,
  'comment': None},
 {'name': 'salary',
  'type': MONEY(),
  'nullable': False,
  'default': None,
  'autoincrement': False,
  'comment': None}]

In [4]:
EmpCol = inspector.get_columns('employees')
EmpCol

# The employee dabtabase is not really needed but it connect to both salaries, and title DB with its emp_no PK and emp_title_id. So it will be bridge that connects the 2 database.

[{'name': 'emp_no',
  'type': INTEGER(),
  'nullable': False,
  'default': None,
  'autoincrement': False,
  'comment': None},
 {'name': 'emp_title_id',
  'type': VARCHAR(),
  'nullable': False,
  'default': None,
  'autoincrement': False,
  'comment': None},
 {'name': 'birth_date',
  'type': DATE(),
  'nullable': False,
  'default': None,
  'autoincrement': False,
  'comment': None},
 {'name': 'first_name',
  'type': VARCHAR(),
  'nullable': False,
  'default': None,
  'autoincrement': False,
  'comment': None},
 {'name': 'last_name',
  'type': VARCHAR(),
  'nullable': False,
  'default': None,
  'autoincrement': False,
  'comment': None},
 {'name': 'sex',
  'type': VARCHAR(),
  'nullable': False,
  'default': None,
  'autoincrement': False,
  'comment': None},
 {'name': 'hire_date',
  'type': DATE(),
  'nullable': False,
  'default': None,
  'autoincrement': False,
  'comment': None}]

In [5]:
titlesCol = inspector.get_columns('titles')
titlesCol

[{'name': 'title_id',
  'type': VARCHAR(),
  'nullable': False,
  'default': None,
  'autoincrement': False,
  'comment': None},
 {'name': 'title',
  'type': VARCHAR(),
  'nullable': False,
  'default': None,
  'autoincrement': False,
  'comment': None}]

In [6]:
# Performing an Engine Execute to get at least the Data in Employee. With a LIMIT 20. I want to see a lot of the data but not all the data.
engine.execute('SELECT * FROM employees LIMIT 20').fetchall()
engine.execute('SELECT * FROM salaries LIMIT 20').fetchall()
engine.execute('SELECT * FROM titles').fetchall()
#Just comment out the 2 that doesnt need to be seen. This is the final part in studying the Data. And titles only have a rows so Limit 20 is not needed. But feel free to put it back on just for consistency.

[('s0001', 'Staff'),
 ('s0002', 'Senior Staff'),
 ('e0001', 'Assistant Engineer'),
 ('e0002', 'Engineer'),
 ('e0003', 'Senior Engineer'),
 ('e0004', 'Technique Leader'),
 ('m0001', 'Manager')]

In [7]:

#Now we can either reflect the Database to study it further or move forward. Since Im using this as a review. Lets reflect the DB to study it further.

#Lets prepare the base to prepare for the reflection. And we can see how all this Data looks like. I would really look like. Since inspect is really just more less about the columns, and execute only shows the data.
Base1 = automap_base()
Base1.prepare(engine, reflect=True)
Title = Base1.classes.titles



Base3 = automap_base()
Base3.prepare(engine, reflect=True)
Employees = Base3.classes.employees

Base2 = automap_base()
Base2.prepare(engine, reflect=True)
Salaries = Base2.classes.salaries

#commenting out Salaries. I may have made an error while building the DB since self._data[key] error. 
#It wont be fixed for this assignment unless it will give me issues later on.

In [8]:

# Now that we got know what Data we are working and what Data Types now we can start working

# Start a session to query the database
session = Session(engine)

In [9]:
# For simplicity the one i want see will be the last which is salaries. Since thats the main criteria. And I only want to see the first row. It will be too much on employees,

Empl1 = session.query(Employees).first()
Empl1.__dict__

title1 = session.query(Title).first()
title1.__dict__


salary1 = session.query(Salaries).first()
# salary1.__dict__
# I tried switching to .first to .all but i got a no attribute error __.dict___. Thats something I will look into more later. It will be ignored for this assignment.

In [10]:

# Capturing the Data. Going with Titles first since its the quickest.

# Rtitle = session.query(Title.title_id, Title.title)

# title_id = []
# titleco = []


# for r in Rtitle:
#     title_id.append(r[0])
#     titleco.append(r[1])

# title_id
# titleco
    

# Remp = session.query(Employees.emp_no, Employees.emp_title_id)

# emp_no = []
# emp_title_id = []


# for r in Remp:
#     emp_no.append(r[0])
#     emp_title_id.append(r[1])


# RSal = session.query(Salaries.emp_no, Salaries.salary)

# salary = []


# for r in RSal:
#     salary.append(r[1])
   
# # All the data is captured. I didnt caputure all the columns since many will repeat. I may not need emp_title_id. Since i already have the title id. I will probably not refer beack to the employees table again. 

# Update: I tried capturing  the data through this. Until i realized i needed a way to use group by

In [11]:
#Querying all the 3 Tables
# I am using the Day 2 Act 10 emoji plotting solved to get this part to help me.

QEmp = session.query(Employees).statement
QSal = session.query(Salaries).statement
Qti = session.query(Title).statement

In [12]:
# Read all 3 tables and Capture them to a data frame
Emp_df = pd.read_sql_query(QEmp, session.bind)


RenDF = Emp_df.rename(columns={'emp_title_id':'title_id'})
RenDF.head(5)

#had to renmae the emp_title_id to title_id for merging purposes

   emp_no title_id  birth_date  first_name  last_name sex   hire_date
0  473302    s0001  1953-07-25    Hideyuki   Zallocco   M  1990-04-28
1  475053    e0002  1954-11-18       Byong  Delgrande   F  1991-09-07
2   57444    e0002  1958-01-30       Berry       Babb   F  1992-03-21
3  421786    s0001  1957-09-28       Xiong   Verhoeff   M  1987-11-26
4  282238    e0003  1952-10-28  Abdelkader    Baumann   F  1991-01-18

In [13]:
Sal_df = pd.read_sql_query(QSal, session.bind)
Sal_df.head(5)

   emp_no      salary
0   10001  $60,117.00
1   10002  $65,828.00
2   10003  $40,006.00
3   10004  $40,054.00
4   10005  $78,228.00

In [14]:
Title_df = pd.read_sql_query(Qti, session.bind)
Title_df.head()

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer

In [32]:
# Now that all the data frames are captures. Time to merge them

#First Combine salary and Employees since thats easier. And I need to add the title df

ComboSalEm = pd.merge(RenDF, Sal_df, on='emp_no', how='left')
ComboSalEm.head(10)

# Trying to figure why i need the title DB at this point other than getting the title names.

,emp_no,title_id,birth_date,first_name,last_name,sex,hire_date,salary
0,473302,s0001,1953-07-25,Hideyuki,Zallocco,M,1990-04-28,"$40,000.00"
1,475053,e0002,1954-11-18,Byong,Delgrande,F,1991-09-07,"$53,422.00"
2,57444,e0002,1958-01-30,Berry,Babb,F,1992-03-21,"$48,973.00"
3,421786,s0001,1957-09-28,Xiong,Verhoeff,M,1987-11-26,"$40,000.00"
4,282238,e0003,1952-10-28,Abdelkader,Baumann,F,1991-01-18,"$40,000.00"
5,263976,e0003,1959-10-30,Eran,Cusworth,M,1986-11-14,"$40,000.00"
6,273487,s0001,1957-04-14,Christoph,Parfitt,M,1991-06-28,"$56,087.00"
7,461591,s0002,1964-11-17,Xudong,Samarati,M,1985-11-13,"$40,000.00"
8,477657,e0002,1962-12-18,Lihong,Magliocco,M,1993-10-23,"$54,816.00"
9,219881,s0002,1956-04-24,Kwangyoen,Speek,F,1993-02-14,"$40,000.00"

In [44]:
#Combine Title with with ComboSalEm - Just notice I spelled Salem
ComboAll = pd.merge(ComboSalEm, Title_df, on='title_id', how='outer')
ComboAll.head(10)

,emp_no,title_id,birth_date,first_name,last_name,sex,hire_date,salary,title
0,473302,s0001,1953-07-25,Hideyuki,Zallocco,M,1990-04-28,"$40,000.00",Staff
1,421786,s0001,1957-09-28,Xiong,Verhoeff,M,1987-11-26,"$40,000.00",Staff
2,273487,s0001,1957-04-14,Christoph,Parfitt,M,1991-06-28,"$56,087.00",Staff
3,246449,s0001,1958-03-23,Subbu,Bultermann,F,1988-03-25,"$87,084.00",Staff
4,48085,s0001,1964-01-19,Venkatesan,Gilg,M,1993-06-28,"$63,016.00",Staff
5,476443,s0001,1952-08-27,Ziya,Asmuth,M,1995-08-24,"$63,371.00",Staff
6,424270,s0001,1963-01-15,Kellyn,Yoshizawa,F,1995-05-08,"$60,678.00",Staff
7,427958,s0001,1957-05-03,Feixiong,Poujol,F,1985-05-11,"$63,377.00",Staff
8,280408,s0001,1964-09-19,Elliott,Perl,M,1987-10-29,"$75,963.00",Staff
9,229010,s0001,1961-11-12,Mark,Cappelli,M,1990-05-07,"$40,000.00",Staff

In [45]:
#Now that we got merge all the DB. Do a group by 

GroupSalary = ComboAll.groupby(by='salary')
GroupSalary.head()

GroupTitle = ComboAll.groupby(by='title').mean()
GroupTitle.head()

# We got 2 database for groupby each one will have a use later. I may or may not need to drop columns now or later if i get stuck.

#I am only seeing title_id, and emp_no. That does not look normal

                           emp_no
title
Assistant Engineer  252992.595373
Engineer            253654.345919
Manager             110780.833333
Senior Engineer     253038.749885
Senior Staff        254481.798969

In [36]:

GroupSalary = ComboAll.groupby(by='salary')
GroupSalary.head()

,emp_no,title_id,birth_date,first_name,last_name,sex,hire_date,salary,title
0,473302,s0001,1953-07-25,Hideyuki,Zallocco,M,1990-04-28,"$40,000.00",Staff
1,475053,e0002,1954-11-18,Byong,Delgrande,F,1991-09-07,"$53,422.00",Engineer
2,57444,e0002,1958-01-30,Berry,Babb,F,1992-03-21,"$48,973.00",Engineer
3,421786,s0001,1957-09-28,Xiong,Verhoeff,M,1987-11-26,"$40,000.00",Staff
4,282238,e0003,1952-10-28,Abdelkader,Baumann,F,1991-01-18,"$40,000.00",Senior Engineer
...,...,...,...,...,...,...,...,...,...
300019,464231,s0001,1958-08-14,Constantino,Eastman,M,1988-10-28,"$69,696.00",Staff
300020,255832,e0002,1955-05-08,Yuping,Dayang,F,1995-02-26,"$75,355.00",Engineer
300021,76671,s0001,1959-06-09,Ortrud,Plessier,M,1988-02-24,"$61,886.00",Staff
300022,264920,s0001,1959-09-22,Percy,Samarati,F,1994-09-08,"$62,772.00",Staff
300023,464503,s0002,1964-05-31,Arvind,Slobodova,M,1987-11-23,"$41,708.00",Senior Staff

In [31]:
# plt.hist(GroupSalary['salary'],histtype='bar', color='red')
# plt.show

#I cant seem to get this to work. So im commenting it out and moving forward. If this would have work i would have populated the table. Im probably forgetting something.

In [ ]:
#Bar Chart

idbar = plt.bar(GroupTitle['title'], GroupTitle[''])
plt.show()